Tests/CordicXML/StateRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAPENV:Envelope 
xmlns:SOAPENV="http://www.w3.org/2003/05/soap-envelope" 
xmlns:SOAPENC="http://www.w3.org/2003/05/soap-encoding" 
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <SOAPENV:Body>
    <StateRequest xmlns="http://www.cordicgateway.com/cni">
      <SourceSystem></SourceSystem>
      <SourcePassword></SourcePassword>
      <SourceJobList>
        <SourceJobID></SourceJobID>
      </SourceJobList>
    </StateRequest>
  </SOAPENV:Body>
</SOAPENV:Envelope>
